<?php
    /*ฟังก์ชันแบบที่ 1 แบบสร้างขึ้นเอง
    function name(){
        $num1 = 11;
        $num2 = 11;
        echo $num1+$num2."<br>";
        echo "My name is class 2-3";
    }
    name();
    */

    /*ฟังก์ชันแบบที่ 2 ฟังก์ชันมาตรฐาน 
    ฟังก์ชัน if กำหมดเงื่อนไข
    if มี 3 แบบ
    1.แบบ 1 เงื่อนไข
    2.แบบ 2 เงื่อนไข
    3.แบบหลายเงื่อนไข
    */

    /*โปรแกรมคำนวณคะแนน
    โจทย์ ข้อที่ 1 ถ้าได้คะแนนมากกว่า 10 คะแนน ให้แสดงคำว่าผ่าน ถ้าน้อยกว่า 10 ไม่แสดงอะไรเลย
    โจทย์ ข้อที่ 2 ถ้าได้คะแนนมากกว่ากว่า 10 คะแนน ให้แสดงคำว่าผ่าน ถ้าน้อยกว่า 10 ให้แสดง ไม่ผ่าน
    โจทย์ ข้อที่ 3 ถ้าได้คะแนนน้อยกว่า 5 คะแนน ให้แสดงคำว่าควรปรับปรุง ถ้าได้ 10 แสดง พอใช้ ถ้าได้คะแนน 15 คะแนนขึ้นไปให้แสดงคำว่า ดีมาก
    */

    $scor = 15;
    if($scor >=10){
        echo "ผ่าน";
    }

    echo "<hr>";

    if($scor >=10){
        echo "ผ่าน";
    }else{
        echo "ไม่ผ่าน";
    }

    echo "<hr>";

    if($scor<5){
        echo "ควรปรับปรุง";
    }elseif($scor == 10){
        echo "พอใช้";
    }elseif($scor >=15){
        echo "ดีมาก";
    }else{
        echo "ไม่เข้าเงื่อนไข";
    }
    
?>